app/controllers/comments_controller.rb

  def new
    @paper = Paper.find(params[:paper_id])
---
SELECT  `papers`.* FROM `papers` WHERE `papers`.`id` = 2 LIMIT 1

  def create
    Comment.create(create_params)
---
INSERT INTO `comments` (`comment`, `paper_id`, `user_id`, `created_at`, `updated_at`) VALUES ('読んでいません！', 2, 2, '2016-10-08 16:07:06', '2016-10-08 16:07:06')

  def destroy
    comment = Comment.find_by(user_id: current_user.id)
    comment.destroy
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`user_id` = 3 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 6

  def edit
    @paper = Paper.find(params[:paper_id])
    @comment = Comment.find(params[:id])
---
SELECT  `papers`.* FROM `papers` WHERE `papers`.`id` = 2 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 7 LIMIT 1

  def update
    comment = Comment.find(params[:id])
    if comment.user_id == current_user.id
      comment.update(comment_params)
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 7 LIMIT 1
UPDATE `comments` SET `comment` = '読んでいないけど、いいと思います。 \r\nなんといっても、タイトルがカッコ良いですね。 \r\n時間があれば是非読みたいです！！！！', `updated_at` = '2016-10-08 17:24:58' WHERE `comments`.`id` = 7