app/controllers/papers_controller.rb

  def index
    @papers = Paper.all.order('id DESC').page(params[:page]).per(5)
---
SELECT  `papers`.* FROM `papers`  ORDER BY id DESC LIMIT 5 OFFSET 0

  def search
    @papers = Paper.where("title LIKE(?)","%#{params[:keyword]}%").limit(20)
---
SELECT  `papers`.* FROM `papers` WHERE (title LIKE('%%')) LIMIT 20

  def show
    @paper = Paper.find(params[:id])
---
SELECT  `papers`.* FROM `papers` WHERE `papers`.`id` = 3 LIMIT 1